In [1]:
import numpy as np
import pandas as pd

In [2]:
a = np.array([1, None, 5, 7, 9])
b = np.array([1, 3, 5, 7, 9])
a.dtype

dtype('O')

In [3]:
b.dtype

dtype('int64')

In [4]:
a.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [5]:
c = np.array([1, np.nan, 5, 7, 9])
c.dtype

dtype('float64')

In [6]:
np.nan?

In [7]:
7 + np.nan

nan

In [8]:
0 * np.nan

nan

In [9]:
c.sum()

nan

In [10]:
np.nansum(c)

22.0

In [11]:
np.nanmean(c)

5.5

In [12]:
s = pd.Series([1, np.nan, 3, None, 7, 9])
s

0    1.0
1    NaN
2    3.0
3    NaN
4    7.0
5    9.0
dtype: float64

In [13]:
s.sum()

20.0

In [14]:
s[0] = None
s

0    NaN
1    NaN
2    3.0
3    NaN
4    7.0
5    9.0
dtype: float64

In [15]:
s.isnull()

0     True
1     True
2    False
3     True
4    False
5    False
dtype: bool

In [16]:
s.notnull()

0    False
1    False
2     True
3    False
4     True
5     True
dtype: bool

In [17]:
s[s.notnull()]

2    3.0
4    7.0
5    9.0
dtype: float64

In [18]:
s.dropna()

2    3.0
4    7.0
5    9.0
dtype: float64

In [19]:
df = pd.DataFrame([[1, 2, np.nan, 4], [5, None, 7, 8], [9, 10, 11, 12]])
df

   0     1     2   3
0  1   2.0   NaN   4
1  5   NaN   7.0   8
2  9  10.0  11.0  12

In [20]:
df.dropna()

   0     1     2   3
2  9  10.0  11.0  12

In [21]:
df.dropna(axis=1)

   0   3
0  1   4
1  5   8
2  9  12

In [22]:
df.dropna(axis='columns')

   0   3
0  1   4
1  5   8
2  9  12

In [23]:
df.fillna(-999)

   0      1      2   3
0  1    2.0 -999.0   4
1  5 -999.0    7.0   8
2  9   10.0   11.0  12

In [24]:
df

   0     1     2   3
0  1   2.0   NaN   4
1  5   NaN   7.0   8
2  9  10.0  11.0  12

In [25]:
s.fillna(method='ffill')

0    NaN
1    NaN
2    3.0
3    3.0
4    7.0
5    9.0
dtype: float64

In [26]:
s.fillna(method='bfill')

0    3.0
1    3.0
2    3.0
3    7.0
4    7.0
5    9.0
dtype: float64

In [27]:
df.fillna(method='ffill', axis=1)

     0     1     2     3
0  1.0   2.0   2.0   4.0
1  5.0   5.0   7.0   8.0
2  9.0  10.0  11.0  12.0